package main

import (
	"fmt"
)

func task1() {
	var value int

	fmt.Println("Введіть чотиризначне число:")
	fmt.Scan(&value)

	// Отримуємо окремі цифри числа
	d1 := value / 1000       // Перша цифра
	d2 := (value / 100) % 10 // Друга цифра
	d3 := (value / 10) % 10  // Третя цифра
	d4 := value % 10         // Четверта цифра

	// Перевіряємо, чи всі цифри різні та чи число чотиризначне, використовуючи логічні операції
	result := (d1 != d2) && (d1 != d3) && (d1 != d4) &&
	          (d2 != d3) && (d2 != d4) &&
	          (d3 != d4) && (value >= 1000 && value <= 9999)

	// Виводимо true, якщо всі цифри різні, інакше false
	fmt.Println(result)
}